const ShinBundang = () => {
    const stationList:any = [
        /* 운영회사, 역번호, 연계역, 지선/본선여부, 역명, 개통여부 */
        ['SB', 'D01', [1,4,'GyeongJung'], , '용산', '미개통'],
        ['SB', 'D02', [], , '국립박물관', '미개통'],
        ['SB', 'D03', [], , '동빙고', '미개통'],
        ['SB', 'D04', [3], , '신사', ''],
        ['SB', 'D05', [7], , '논현', ''],
        ['SB', 'D06', [8], , '신논현', ''],
        ['SB', 'D07', [2], , '강남', ''],
        ['SB', 'D08', [3], , '양재', ''],
        ['SB', 'D09', [], , '양재시민의숲', ''],
        ['SB', 'D10', [], , '청계산입구', ''],
        ['SB', 'D11', ['G'], , '판교', ''],
        ['SB', 'D12', ['SuinBundang'], , '정자', ''],
        ['SB', 'D13', ['SuinBundang'], , '미금', ''],
        ['SB', 'D14', [], , '동천', ''],
        ['SB', 'D15', [], , '수지구청', ''],
        ['SB', 'D16', [], , '성복', ''],
        ['SB', 'D17', [], , '상현', ''],
        ['SB', 'D18', [], , '광교중앙', ''],
        ['SB', 'D19', [], , '광교', ''],
        ['SB', 'D19', [], , '수원월드컵경기장', '미개통'],
        ['SB', 'D20', [], , '동수원', '미개통'],
        ['SB', 'D21', [1], , '화서', '미개통'],
        ['SB', 'D22', [], , '호매실', '미개통']
    ]
}

export default ShinBundang