const UI = () => {
    /* 우이신설선의 경우 관리역번호로 조회가능, 공식 역번호는 따로 있음 */
    const stationList:any = [
        /* 운영회사, 역번호, 연계역, 지선/본선여부, 역명, 개통여부 */
        ['UI', '701', [], , '북한산우이', ''],
        ['UI', '702', [], , '솔밭공원', ''],
        ['UI', '703', [], , '419민주묘지', ''],
        ['UI', '704', [], , '가오리', ''],
        ['UI', '705', [], , '화계', ''],
        ['UI', '706', [], , '삼양', ''],
        ['UI', '707', [], , '삼양사거리', ''],
        ['UI', '708', [], , '솔샘', ''],
        ['UI', '709', [], , '북한산보국문', ''],
        ['UI', '710', [], , '정릉', ''],
        ['UI', '711', [4], , '성신여대입구', ''],
        ['UI', '712', [6], , '보문', ''],
        ['UI', '713', [1,'SS'], , '신설동', ''],
        /* 방학지선 */
        ['UI', '000', ['UI'], , '솔밭공원', '미개통'],
        ['UI', '000', [], , '해등', '미개통'],
        ['UI', '000', [], , '도당', '미개통'],
        ['UI', '000', [1], , '방학', '미개통']
    ]
}
export default UI