const Gyeongchun = () => {
    const stationList:any = [
        /* 운영회사, 역번호, 연계역, 지선/본선여부, 역명, 개통여부 */
        ['K' ,'K117', [1,'GyeongJung','SuinBundang'], , '청량리', ''],
        ['K' ,'K118', [1, 'GyeongJung'], , '회기', ''],
        ['K' ,'K119', ['GyeongJung'], , '중랑', ''],
        ['K' ,'K120', [7,'GyeongJung'], , '상봉', ''],
        ['K' ,'K121', ['GyeongJung'], , '망우', ''],
        ['K' ,'K122', [6], , '신내', ''],
        ['K' ,'K123', [], , '갈매', ''],
        ['K' ,'K124', [], , '별내', ''],
        ['K' ,'K125', [], , '퇴계원', ''],
        ['K' ,'K000', [], , '왕숙', '미개통'],
        ['K' ,'K126', [], , '사릉', ''],
        ['K' ,'K127', [], , '금곡', ''],
        ['K' ,'K128', [], , '평내호평', ''],
        ['K' ,'K129', [], , '천마산', ''],
        ['K' ,'K130', [], , '마석', ''],
        ['K' ,'K131', [], , '대성리', ''],
        ['K' ,'K132', [], , '청평', ''],
        ['K' ,'K133', [], , '상천', ''],
        ['K' ,'K134', [], , '가평', ''],
        ['K' ,'K135', [], , '굴봉산', ''],
        ['K' ,'K136', [], , '백양리', ''],
        ['K' ,'K137', [], , '강촌', ''],
        ['K' ,'K138', [], , '김유정' ,''],
        ['K' ,'K139', [], , '남춘천', ''],
        ['K' ,'K140', [], , '춘천', '']
    ]
}
export default Gyeongchun