const TransferInfo = () => {
    const transferInfo:any = [
        ['1호선', 1], ['2호선', 2], ['3호선', 3], ['4호선', 4], ['5호선', 5], ['6호선', 6], ['7호선', 7], ['8호선', 8], ['9호선', 9],
        ['경의중앙선', 'GyeongJung'], ['수인분당선', 'SuinBundang'], ['경춘선', 'Gyeongchun'],
        ['우이신설선', 'UI'], ['신분당선', 'ShinBundang'], ['공항철도', 'Airport'], ['김포도시철도', 'GG'],
        ['신림선', 'SR'], ['인천1호선', 'I1'], ['인천2호선', 'I2'], ['의정부경전철', 'UL'], ['용인에버라인', 'YE'],
        ['경강선', 'G1'], ['서해선', 'SH'], ['ITX-청춘', 'ITX'], ['성수(지)', 'SS'], ['신정(지)', 'SJ'], ['마천(지)', 'MC']
    ]
}
export default TransferInfo