import type { NextPage } from 'next'
import { useRouter } from 'next/router'
import { useEffect } from 'react'

import axios from 'axios'
import Head from 'next/head'
import Link from 'next/link'

import Line1 from '../../components/line_info/line1'
import CustomerCenter from '../../components/customerCall'

const Test: NextPage = () => {
  console.log(Line1)
    const stationList:any = [
        /* 운영회사, 역번호, 연계역, 지선/본선여부, 역명, 개통여부 */
        ['K', '097', [], , '연천', '미개통'],
        ['K', '098', [], , '전곡', '미개통'],
        ['K', '099', [], , '초성리', '미개통'],
        ['K', '100', [], , '소요산', ''],
        ['K', '101', [], , '동두천', ''],
        ['K', '102', [], , '보산', ''],
        ['K', '103', [], , '동두천중앙', ''],
        ['K', '104', [], , '지행', ''],
        ['K', '105', [], , '덕정', ''],
        ['K', '000', [], , '회정', '미개통'],
        ['K', '106', [], , '덕계', ''],
        ['K', '107', [], , '양주', ''],
        ['K', '108', [], , '녹양', ''],
        ['K', '109', [], , '가능', ''],
        ['K', '110', [], , '의정부', ''],
        ['K', '111', ['UL'], , '회룡', ''],
        ['K', '112', [], , '망월사', ''],
        ['K', '113', [7], , '도봉산', ''],
        ['K', '114', [], , '도봉', ''],
        ['K', '115', [], , '방학', ''],
        ['K', '116', [4], , '창동', ''],
        ['K', '117', [], , '녹천', ''],
        ['K', '118', [], , '월계', ''],
        ['K', '119', ['Gyeongchun'], , '광운대', ''],
        ['K', '120', [6], , '석계', ''],
        ['K', '121', [], , '신이문', ''],
        ['K', '122', [], , '외대앞', ''],
        ['K', '123', ['GyeongJung', 'Gyeongchun'], , '회기', ''],
        ['S', '124', [], , '지하청량리', ''],
        ['S', '125', [], , '제기동', ''],
        ['S', '126', ['UI', '2SS'], , '신설동', ''],
        ['S', '127', [6], , '동묘앞', ''],
        ['S', '128', [4], , '동대문', ''],
        ['S', '129', [], , '종로5가', ''],
        ['S', '130', [3, 5], , '종로3가', ''],
        ['S', '131', [], , '종각', ''],
        ['S', '132', [2], , '시청', ''],
        ['S', '133', [4, 'Airport', 'GyeongJung'], , '지하서울역', ''],
        ['K', '134', [], , '남영', ''],
        ['K', '135', ['Gyeongjung', 'ITX'], , '용산', ''],
        ['K', '136', [9], , '노량진', ''],
        ['K', '137', ['SR'], , '대방', ''],
        ['K', '138', [5], , '신길', ''],
        ['K', '139', [], , '영등포', ''],
        ['K', '140', [2, '2SJ'], , '신도림', ''],
        ['K', '141', [], , '구로', ''],
        ['K', '142', [], , '구일', ''],
        ['K', '143', [], , '개봉', ''],
        ['K', '144', [], , '오류동', ''],
        ['K', '145', [7], , '온수', ''],
        ['K', '146', [], , '역곡', ''],
        ['K', '147', ['SH'], , '소사', ''],
        ['K', '148', [], , '부천', ''],
        ['K', '149', [], , '중동', ''],
        ['K', '150', [], , '송내', ''],
        ['K', '151', [], , '부개', ''],
        ['K', '152', ['I1'], , '부평', ''],
        ['K', '153', [], , '백운', ''],
        ['K', '154', [], , '동암', ''],
        ['K', '155', [], , '간석', ''],
        ['K', '156', ['I2'], , '주안', ''],
        ['K', '157', [], , '도화', ''],
        ['K', '158', [], , '제물포', ''],
        ['K', '159', [], , '도원', ''],
        ['K', '160', [], , '동인천', ''],
        ['K', '161', ['SuinBundang'], , '인천', ''],
        ['K', 'P141', [], '경부선', '구로', ''],
        ['K', 'P142', [], '경부선', '가산디지털단지', ''],
        ['K', 'P143', [], '경부선', '독산', ''],
        ['K', 'P144', [], '경부선', '금천구청', ''],
        ['K', 'P145', [], '경부선', '석수', ''],
        ['K', 'P146', [], '경부선', '관악', ''],
        ['K', 'P147', [], '경부선', '안양', ''],
        ['K', 'P148', [], '경부선', '명학', ''],
        ['K', 'P159', [4], '경부선', '금정', ''],
        ['K', 'P150', [], '경부선', '군포', ''],
        ['K', 'P151', [], '경부선', '당정', ''],
        ['K', 'P152', [], '경부선', '의왕', ''],
        ['K', 'P153', [], '경부선', '성균관대', ''],
        ['K', 'P154', [], '경부선', '화서', ''],
        ['K', 'P155', ['SuinBundang'], '경부선', '수원', ''],
        ['K', 'P156', [], '경부선', '세류', ''],
        ['K', 'P157', [], '경부선', '병점', ''],
        ['K', 'P158', [], '경부선', '세마', ''],
        ['K', 'P159', [], '경부선', '오산대', ''],
        ['K', 'P160', [], '경부선', '오산', ''],
        ['K', 'P161', [], '경부선', '진위', ''],
        ['K', 'P162', [], '경부선', '송탄', ''],
        ['K', 'P163', [], '경부선', '서정리', ''],
        ['K', 'P164', [], '경부선', '평택지제', ''],
        ['K', 'P165', [], '경부선', '평택', ''],
        ['K', 'P166', [], '경부선', '성환', ''],
        ['K', 'P167', [], '경부선', '직산', ''],
        ['K', 'P000', [], '경부선', '부성', '미개통'],
        ['K', 'P168', [], '경부선', '두정', ''],
        ['K', 'P169', [], '경부선', '천안', ''],
        ['K', 'P170', [], '경부선', '봉명', ''],
        ['K', 'P171', [], '경부선', '쌍용', ''],
        ['K', 'P172', [], '경부선', '아산', ''],
        ['K', 'P173', [], '경부선', '탕정', ''],
        ['K', 'P174', [], '경부선', '배방', ''],
        ['K', 'P175', [], '경부선', '풍기', '미개통'],
        ['K', 'P176', [], '경부선', '온양온천', ''],
        ['K', 'P177', [], '경부선', '신창', ''],
        ['K', 'P144-1', [], '경부고속선', '광명', ''],
        ['K', 'P157-1', [], '병점기지선', '서동탄', '']
  ]

  return (
    <>
      <Head>
        <meta name="viewport" content="width=device-width, initial-scale=1" />
      </Head>
      <main>
        {
          stationList.map((e:any, key:number) => {
            if(e[5] !== '미개통') {
              return(
              <div className='row' key={key}>
                <div className='direction_down'>
                  <div className={ 'down_approach stnid_' + e[1] }></div>
                  <div className={ 'down_arrival stnid_' + e[1] }></div>
                  <div className={ 'down_leave stnid_' +  e[1]} ></div>
                </div>
                <div className='station_info'>
                  <div>
                    <span className='StnId bg line_1'>{e[1]}</span>
                    <span className='StnName'>{e[4]}</span>
                    {e[2].map((x:any, key:number)=><span key={key}>{x}</span>)}
                  </div>
                </div>
                <div className='direction_up'>
                  <div className={'up_approach stnid_' + e[1]}></div>
                  <div className={'up_arrival stnid_' + e[1]}></div>
                  <div className={'up_leave stnid_' + e[1]}></div>
                </div>
              </div>)}
          })
        }
      </main>
    </>
  )
}

export default Test